<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of REDCINE-X PRO from the in-app Sparkle feed.

The application also contains references to a Sparkle URL for beta updates:
http://red.cachefly.net/redcinex/appcast/mac_pkg_beta.xml

SPARKLE_FEED_URL could be overridden to the above if you wish to fetch beta versions.</string>
    <key>Identifier</key>
    <string>com.github.timsutton.download.redcine-xpro</string>
    <key>Input</key>
    <dict>
		<key>curl_opts</key>
		<array>
			<string>-H user-agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/127.0.0.0 Safari/537.36</string>
		</array>
        <key>NAME</key>
        <string>REDCINE-XPRO</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://downloads.red.com/software/rcx/rss/mac_pkg.xml</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
